<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" class="svg-defs">
  <symbol id="icon-facebook1" viewBox="0 0 32 32"><title>facebook1</title> <path d="M19 6h5v-6h-5c-3.86 0-7 3.14-7 7v3h-4v6h4v16h6v-16h5l1-6h-6v-3c0-0.542 0.458-1 1-1z"></path> </symbol>
  <symbol id="icon-line" viewBox="0 0 32 32"><title>line</title> <path d="M25.82 13.151c0.465 0 0.84 0.38 0.84 0.841s-0.375 0.84-0.84 0.84h-2.34v1.5h2.34c0.465 0 0.84 0.377 0.84 0.84 0 0.459-0.375 0.839-0.84 0.839h-3.181c-0.46 0-0.836-0.38-0.836-0.839v-6.361c0-0.46 0.376-0.84 0.84-0.84h3.181c0.461 0 0.836 0.38 0.836 0.84 0 0.465-0.375 0.84-0.84 0.84h-2.34v1.5zM20.68 17.172c0 0.36-0.232 0.68-0.576 0.795-0.085 0.028-0.177 0.041-0.265 0.041-0.281 0-0.521-0.12-0.68-0.333l-3.257-4.423v3.92c0 0.459-0.372 0.839-0.841 0.839-0.461 0-0.835-0.38-0.835-0.839v-6.361c0-0.36 0.231-0.68 0.573-0.793 0.080-0.031 0.181-0.044 0.259-0.044 0.26 0 0.5 0.139 0.66 0.339l3.283 4.44v-3.941c0-0.46 0.376-0.84 0.84-0.84 0.46 0 0.84 0.38 0.84 0.84zM13.025 17.172c0 0.459-0.376 0.839-0.841 0.839-0.46 0-0.836-0.38-0.836-0.839v-6.361c0-0.46 0.376-0.84 0.84-0.84 0.461 0 0.837 0.38 0.837 0.84zM9.737 18.011h-3.181c-0.46 0-0.84-0.38-0.84-0.839v-6.361c0-0.46 0.38-0.84 0.84-0.84 0.464 0 0.84 0.38 0.84 0.84v5.521h2.341c0.464 0 0.839 0.377 0.839 0.84 0 0.459-0.376 0.839-0.839 0.839zM32 13.752c0-7.161-7.18-12.989-16-12.989s-16 5.828-16 12.989c0 6.415 5.693 11.789 13.38 12.811 0.521 0.109 1.231 0.344 1.411 0.787 0.16 0.401 0.105 1.021 0.051 1.44l-0.219 1.36c-0.060 0.401-0.32 1.581 1.399 0.86 1.721-0.719 9.221-5.437 12.581-9.3 2.299-2.519 3.397-5.099 3.397-7.957z"></path> </symbol>
  <symbol id="icon-twitter" viewBox="0 0 32 32"><title>twitter</title> <path d="M31.939 6.092c-1.18 0.519-2.44 0.872-3.767 1.033 1.352-0.815 2.392-2.099 2.884-3.631-1.268 0.74-2.673 1.279-4.169 1.579-1.195-1.279-2.897-2.079-4.788-2.079-3.623 0-6.56 2.937-6.56 6.556 0 0.52 0.060 1.020 0.169 1.499-5.453-0.257-10.287-2.876-13.521-6.835-0.569 0.963-0.888 2.081-0.888 3.3 0 2.28 1.16 4.284 2.917 5.461-1.076-0.035-2.088-0.331-2.971-0.821v0.081c0 3.18 2.257 5.832 5.261 6.436-0.551 0.148-1.132 0.228-1.728 0.228-0.419 0-0.82-0.040-1.221-0.115 0.841 2.604 3.26 4.503 6.139 4.556-2.24 1.759-5.079 2.807-8.136 2.807-0.52 0-1.039-0.031-1.56-0.089 2.919 1.859 6.357 2.945 10.076 2.945 12.072 0 18.665-9.995 18.665-18.648 0-0.279 0-0.56-0.020-0.84 1.281-0.919 2.4-2.080 3.28-3.397z"></path> </symbol>
</svg>

<?php // SNSのリンク設定で、エンコードして出力するため、変数に格納しておく
$title = the_title( '', '', false );
$hashtag1 = 'ジュエルカフェ';
$permalink = get_permalink($post->ID);
?>
<ul class="snsBox">
  <li class="facebook">
    <a href="//www.facebook.com/sharer/sharer.php?u=<?php the_permalink(); ?>" title="facebook" target="_blank" rel="nofollow noopener">
      <svg viewBox="0 0 32 32" class="icon-facebook1"><use xlink:href="#icon-facebook1"></use></svg>
    </a>
  </li>
  <li class="twitter">
    <a href="https://twitter.com/intent/tweet?text=<?php echo urlencode($title); ?>+%23<?php echo urlencode($hashtag1); ?>&url=<?php echo urlencode($permalink); ?>" title="twitter" target="_blank" rel="nofollow noopener">
    <svg viewBox="0 0 32 32" class="icon-twitter"><use xlink:href="#icon-twitter"></use></svg>
    </a>
  </li>
  <li class="line">
    <a href="//timeline.line.me/social-plugin/share?url=<?php echo urlencode($permalink); ?>" title="line" target="_blank" rel="nofollow noopener">
      <svg viewBox="0 0 32 32" class="icon-line"><use xlink:href="#icon-line"></use></svg>
    </a>
  </li>
</ul>
